Catalogs/Противники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Противники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗдоровье</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиПротивников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияЦикла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеЦикла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийПротивников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СложностиПротивников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СложностиПротивников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Элитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Босс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Противники/Ext/ManagerModule.bsl
// Возвращает случайного противоника из справочника.
// 
// Параметры:
// 	ГСЧ - ГенераторСлучайныхЧисел - переменная для генерации случайных чисел.
// 	СложностьВход - EnumRef.СложностиПротивников - сложность противника для отбора.
//
// Возвращаемое значение:
// 	СправочникСсылка.Противники - ссылка на случайного противоника.
//
Функция ПолучитьСлучайногоПротивника(ГСЧ, СложностьВход = Неопределено) Экспорт
	Если СложностьВход = Неопределено Тогда
		СложностьРабочая = Перечисления.СложностиПротивников.Обычная;
	Иначе
		СложностьРабочая = СложностьВход;
	КонецЕсли;
	
	РезультатФункции = Справочники.Противники.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Противники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Противники КАК Противники
		|ГДЕ
		|	Противники.ПометкаУдаления = ЛОЖЬ
		|	И Противники.Сложность = &СложностьРабочая
		|
		|УПОРЯДОЧИТЬ ПО
		|	Противники.Код УБЫВ";
	Запрос.УстановитьПараметр("СложностьРабочая", СложностьРабочая);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Индекс = ГСЧ.СлучайноеЧисло(0, Выгрузка.Количество() - 1);
		РезультатФункции = Выгрузка[Индекс].Ссылка;
	Иначе
		РезультатФункции = Справочники.Противники.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьСлучайногоПротивника()

// Возвращает максимальную силу из табличной части ДействияЦикла противника.
// 
// Параметры:
// 	СсылкаНаПротивника - СправочникСсылка.Противники - ссылка на противника.
//
// Возвращаемое значение:
// 	Число - максимальное значение силы из всех действий цикла, или 0 если табличная часть пуста.
//
Функция ПолучитьМаксимальнуюСилуИзДействийЦикла(СсылкаНаПротивника) Экспорт
	РезультатФункции = 0;
	
	Если СсылкаНаПротивника.Пустая() Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	МАКСИМУМ(ДействияЦикла.МинимальнаяСила) КАК МаксимальнаяСила
		|ИЗ
		|	Справочник.Противники.ДействияЦикла КАК ДействияЦикла
		|ГДЕ
		|	ДействияЦикла.Ссылка = &СсылкаНаПротивника";
	
	Запрос.УстановитьПараметр("СсылкаНаПротивника", СсылкаНаПротивника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ Выборка.МаксимальнаяСила = Неопределено Тогда
				РезультатФункции = Выборка.МаксимальнаяСила;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции		// ПолучитьМаксимальнуюСилуИзДействийЦикла()

// Возвращает таблицу значений с действиями цикла противника.
// 
// Параметры:
//  СсылкаНаПротивника - СправочникСсылка.Противники - ссылка на противника.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками: ДействиеЦикла, МинимальнаяСила, МаксимальнаяСила.
//
Функция ПолучитьТаблицуДействийЦикла(СсылкаНаПротивника) Экспорт
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции.Колонки.Добавить("ДействиеЦикла");
	РезультатФункции.Колонки.Добавить("МинимальнаяСила");
	РезультатФункции.Колонки.Добавить("МаксимальнаяСила");
	Если НЕ СсылкаНаПротивника.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|	ДействияЦикла.ДействиеЦикла КАК ДействиеЦикла,
			|	ДействияЦикла.МинимальнаяСила КАК МинимальнаяСила,
			|	ДействияЦикла.МаксимальнаяСила КАК МаксимальнаяСила
			|ИЗ
			|	Справочник.Противники.ДействияЦикла КАК ДействияЦикла
			|ГДЕ
			|	ДействияЦикла.Ссылка = &СсылкаНаПротивника";
		Запрос.УстановитьПараметр("СсылкаНаПротивника", СсылкаНаПротивника);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			РезультатФункции = РезультатЗапроса.Выгрузить();
		Иначе
			// Результат запроса пустой, возвращаем пустую таблицу с настроенными колонками
		КонецЕсли;
	Иначе
		// Ссылка пустая, возвращаем пустую таблицу с настроенными колонками
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьТаблицуДействийЦикла()
